УправДом/src/Documents/УстановкаНачальныхПоказанийЭлектроснабжения/УстановкаНачальныхПоказанийЭлектроснабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаНачальныхПоказанийЭлектроснабжения</name>
  <registerRecords>InformationRegister.СведенияПоЭлектроснабжению</registerRecords>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачальныеПоказания</name>
    <attributes>
      <name>КрайниеПереданныеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайниеОплаченныеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/СведенияПоЭлектроснабжению/СведенияПоЭлектроснабжению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияПоЭлектроснабжению</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТекущиеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказанияНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяцаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Documents/УстановкаНачальныхПоказанийЭлектроснабжения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СведенияПоГазоснабжению
	Движения.СведенияПоЭлектроснабжению.Записывать = Истина;
	Для Каждого ТекСтрокаНачальныеПоказания Из НачальныеПоказания Цикл
		Движение = Движения.СведенияПоЭлектроснабжению.Добавить();
		Движение.Период = Дата;
		Движение.ТекущиеПоказания = ТекСтрокаНачальныеПоказания.КрайниеПереданныеПоказания;
		Движение.ПоказанияНачисления = ТекСтрокаНачальныеПоказания.КрайниеОплаченныеПоказания;
		Движение.Количество = ТекСтрокаНачальныеПоказания.Количество;
		Движение.Сумма = ТекСтрокаНачальныеПоказания.СуммаПлатежа;
		Движение.КодМесяцаОплаты = 0;
	КонецЦикла;

КонецПроцедуры
